"use client";
import { useEffect, useState } from "react";
import "bootstrap/dist/css/bootstrap.min.css";
import "aos/dist/aos.css";
import AOS from "aos";
import Nav from "@/components/Nav/Nav";
import "./globals.css";
import { usePathname } from "next/navigation";
import Loader from "@/components/loader/Loader";

export default function RootLayout({
  children,
}: Readonly<{
  children: React.ReactNode;
}>) {
  useEffect(() => {
    AOS.init({
      duration: 800,
      once: true,
    });
  }, []);
  const pathName = usePathname();

  const links = [
    {
      name: "الرئيسية",
      go: "/",
    },
    {
      name: "عن الجامعة",

      dropdownLinks: {
        links: [
          {
            name: "تاريخ و حقائق",

            subLinks: [
              { name: "كلمة رئيس الجامعة", go: "/" },
              { name: "حقائق وأرقام", go: "/" },
              { name: "تاريخ الجامعة", go: "/" },
              { name: "رؤية الجامعة", go: "/" },
              { name: "رسالة الجامعة", go: "/" },
              { name: "أهداف الجامعة", go: "/" },
              { name: "ترتيب الجامعة بين جامعات العالم", go: "/" },
            ],
          },
          {
            name: "قطاعات الجامعه",

            subLinks: [
              { name: "قطاع شئؤن التعليم والطلاب", go: "/" },
              { name: "قطاع شئون الدراسات العليا والبحوث", go: "/" },
              { name: "قطاع خدمة المجتمع وتنمية البيئة", go: "/" },
              { name: "قطاع أمين عام الجامعة", go: "/" },
            ],
          },
          { name: "الهيكل التنظيمى للجامعة", go: "/" },
          { name: "سياسة الجودة", go: "/" },
          { name: "سياسة الخصوصية", go: "/" },
          { name: "بيانات الاتصال", go: "/" },
          { name: "اسأل رئيس الجامعة", go: "/" },
          { name: "المؤتمرات والأحداث", go: "/" },
          { name: "خريطة الموقع", go: "/" },
          { name: "الجامعة في مواجهة كورونا", go: "/" },
          { name: "التنمية المستدامة", go: "/" },
          { name: "وظائف مطلوبة داخل الجامعة", go: "/" },
        ],
      },
    },

    {
      name: "الكليات و البرامج النوعية",
      go: "/services",
    },
    {
      name: "المراكز و الوحدات",

      dropdownLinks: {
        links: [
          {
            name: "مراكز التطوير بالجامعة",

            subLinks: [
              { name: "مركز تطوير الأداء الجامعي", go: "/" },
              { name: "مركز ضمان الجودة وتقييم الأداء", go: "/" },
              { name: "مركز القياس والتقويم", go: "/" },
              { name: "المركز الجامعي للتطوير المهني", go: "/" },
            ],
          },
          {
            name: "المراكز والوحدات الخاصة",

            subLinks: [
              { name: "مركز انطلاق", go: "/" },
              { name: "مركز دار الضيافة والؤتمرات", go: "/" },
              { name: "مركز خدمات الأشخاص ذوى الإعاقة", go: "/" },
              { name: "مركز المعلومات والتوثيق ودعم اتخاذ القرار", go: "/" },
              { name: "مركز دعم الصناعات الصغيرة والمتوسطة", go: "/" },
              { name: "مكتب دعم الابتكار ونقل وتسويق التكنولوجيا", go: "/" },
              { name: "وحدة مناهضة العنف ضد المرأة", go: "/" },
              { name: "لجنة مواجهة خطر الإدمان والتعاطي", go: "/" },
            ],
          },
          {
            name: "اندية الجامعة",

            subLinks: [
              { name: "نادى اعضاء هيئة التدريس", go: "/" },
              { name: "نادى النيل", go: "/" },
            ],
          },
          {
            name: "مركز التدريب والتدريس",

            subLinks: [
              { name: "مركز التدريب الاداري والاستشارات", go: "/" },
              { name: "مركز التدريب الرقمي", go: "/" },
              { name: "مركز اللغة الانجليزية للأغراض الخاصة", go: "/" },
              { name: "مركز رعاية وتنمية الطفولة", go: "/" },
              { name: "مركز تكنولوجيا التعليم", go: "/" },
              { name: "مركز الخدمة العامة للغات والترجمة", go: "/" },
              {
                name: "مركز الخدمة العامة بكلية التربية للطفولة المبكرة",
                go: "/",
              },
            ],
          },
        ],
      },
    },
    {
      name: "الرعاية الصحيه",
      go: "/doctors",
      dropdownLinks: {
        links: [
          {
            name: "المستشفيات",
            subLinks: [
              { name: "المستشفى الرئيسي", go: "/" },
              { name: "مستشفى الطوارئ", go: "/" },
              { name: "مستشفى الباطنة التخصصى", go: "/" },
              { name: "مستشفى الأطفال الجامعى", go: "/" },
              { name: "مستشفى الطلبة الجامعى", go: "/" },
              { name: "مستشفى النقاهة", go: "/" },
            ],
          },
          {
            name: "المراكز الطبية",
            subLinks: [
              { name: "مركز الكلى والمسالك البولية", go: "/" },
              { name: "مركز طب وجراحة العيون", go: "/" },
              { name: "مركز جراحة الجهاز الهضمي", go: "/" },
              { name: "مركز الأورام", go: "/" },
              { name: "مركز جراحة الحروق والتجميل", go: "/" },
              {
                name: "مركز جراحة القلب والصدر وجراحة الأوعية الدموية",
                go: "/",
              },
              { name: "المراكز الطبية الثلاث", go: "/" },
            ],
          },
        ],
      },
    },
    {
      name: "الاخبار و الميديا",
      go: "#",
      dropdownLinks: {
        links: [
          { name: "الأخبار", go: "/" },
          { name: "أرشيف الأخبار", go: "/" },
          { name: "ميديا الجامعة", go: "/" },
          { name: "خريطة الجامعة", go: "/" },
        ],
      },
    },
  ];
  const mfmLinks = [
    {
      name: "الرئيسية",
      go: "/",
    },
    {
      name: "عن الكلية",

      dropdownLinks: {
        links: [
          {
            name: "نبذه عن الكلية",
            subLinks: [
              { name: "تاريخ الكلية", go: "/mfm" },
              { name: "الاهداف الاستيراتيجية", go: "/mfm" },
              { name: "الخطه الاستيراتيجيه لكلية الطب", go: "/mfm" },
              { name: "الرؤيه و الرساله", go: "/mfm" },
              { name: "الهيكل التنظيمي", go: "/mfm" },
              { name: "خريطة الموقع", go: "/mfm" },
              { name: "خرائط الكلية", go: "/mfm" },
            ],
          },
          {
            name: "الادارة",
            subLinks: [
              { name: "عميد الكلية", go: "/mfm" },
              { name: "وكيل الكلية لشئون التعليم و الطلاب", go: "/mfm" },
              {
                name: "وكيل الكلية لشئون الدراسات العليا و البحوث",
                go: "/mfm",
              },
              {
                name: "وكيل الكلية لشئون خدمة المجتمع و تنمية البيئة",
                go: "/mfm",
              },
              { name: "امين الكلية", go: "/mfm" },
            ],
          },
          {
            name: "الادارات السابقة",
            subLinks: [
              { name: "العمداء", go: "/mfm" },
              {
                name: "وكلاء الكلية لشئون التعليم و الطلاب السابقون",
                go: "/mfm",
              },
              {
                name: "وكلاء الكلية لشئون خدمة المجتمع و تنمية البيئة",
                go: "/mfm",
              },
              {
                name: "وكلاء الكلية لشئون الدراسات العليا السابقون",
                go: "/mfm",
              },
            ],
          },
        ],
      },
    },
    {
      name: "القطاعات",
      dropdownLinks: {
        links: [
          {
            name: "شئون التعليم و الطلاب",
            subLinks: [
              {
                name: "البرامج التعليميه لمرحلة البكالوريوس - البرنامج الاساسي ",
                go: "/mfm",
              },
              { name: "الخدمات الطلابية", go: "/mfm" },
              { name: "وحدة الدعم الطلابي", go: "/mfm" },
              { name: "الاساسيات", go: "/mfm" },
              { name: "اتحاد الطلاب", go: "/mfm" },
              { name: "الانشطة الطلابية و رعاية الشباب", go: "/mfm" },
              { name: "دليل الطالب نظام قديم", go: "/mfm" },
              { name: "دليل الطالب نظام مطور", go: "/mfm" },
              { name: "تحميل مستندات", go: "/mfm" },
              { name: "الجمعية العلميه لطلاب طب المنوفية", go: "/mfm" },
              { name: "روابط هامة", go: "/mfm" },
              { name: "دليل الطالب نظام مطور", go: "/mfm" },
              { name: "اطباء الامتياز log Book", go: "/mfm" },
              { name: "الاستبيانات", go: "/mfm" },
            ],
          },
          {
            name: "الدراسات العليا و البحوث",
            go: "/mfm",
          },
          {
            name: "شئون خدمة المجتمع و تنمية البيئة",
            go: "/mfm",
          },
        ],
      },
    },
    {
      name: "الاقسام العلميه",

      dropdownLinks: {
        links: [
          {
            name: "الاقسام الاكاديمية",
            subLinks: [
              {
                name: "التشريح و علم الاجنة",
                go: "/mfm",
              },
              { name: "الباثولوجي التشريحي", go: "/mfm" },
              { name: "الطفيليات الطبية", go: "/mfm" },
              { name: "الفارمامولوجيا الاكلينيكيه", go: "/mfm" },
              { name: "الفيسيولوجيا الطبيه", go: "/mfm" },
              { name: "الكيمياء الحيوية", go: "/mfm" },
              { name: "الميكروبيولوجياو المناعة الطبية", go: "/mfm" },
              { name: "الهستولوجي", go: "/mfm" },
              { name: "التعليم الطبي", go: "/mfm" },
            ],
          },
          {
            name: "الاقسام الاكلينيكية",
            subLinks: [
              {
                name: "طب الاطفال",
                go: "/mfm",
              },
              { name: "جراحة المخ والاعصاب", go: "/mfm" },
              { name: "جراحة الاوعية الدموية", go: "/mfm" },
              { name: "امراض النساء و التوليد", go: "/mfm" },
              { name: "جراحة العظام", go: "/mfm" },
              { name: "جراحة القلب و الصدر", go: "/mfm" },
              {
                name: "الانف و الاذن و الحنجره و جراحة الرأس و الرقبة",
                go: "/mfm",
              },
              { name: "القلب و الاوعية الدموية", go: "/mfm" },
              { name: "علاج الاورام و الطب النووى", go: "/mfm" },
              { name: "الجراحةالعامة", go: "/mfm" },
              {
                name: "التخدير و العناية المركزةالجراحية و علاج الالم",
                go: "/mfm",
              },
              { name: "الصحة العامة و طب المجتمع", go: "/mfm" },
            ],
          },
          {
            name: "الاقسام الاكلينيكية",
            subLinks: [
              {
                name: "الامراض الجلدية و التناسلية و الذكوره",
                go: "/mfm",
              },
              { name: "طب و جراحة العيون", go: "/mfm" },
              { name: "امراض الباطنة", go: "/mfm" },
              { name: "الباثولوجيا الاكلينيكية", go: "/mfm" },
              { name: "طب المخ و الاعصاب", go: "/mfm" },
              { name: "الاشعة التشخيصية", go: "/mfm" },
              {
                name: "الامراض المتوطنة",
                go: "/mfm",
              },
              { name: "جراحة المسالك البولية", go: "/mfm" },
              { name: "الطب النفسي", go: "/mfm" },
              { name: "جراحة التجميل و الحروق", go: "/mfm" },
              {
                name: "الطب الطبيعي و الروماتيزم و التأهيل",
                go: "/mfm",
              },

              { name: "الامراض الصدرية", go: "/mfm" },
            ],
          },
        ],
      },
    },
    {
      name: "المراكز و الوحدات",
      dropdownLinks: {
        links: [
          {
            name: "المراكز",

            subLinks: [
              { name: "مركز الكلي و المسالك البولية", go: "/mfm" },
              { name: "مركز جراحة و طب العيون", go: "/mfm" },
              {
                name: "مركز جراحة القلب و الصدر و جراحة الاوعية الدموية",
                go: "/mfm",
              },
              { name: "مركز جراحة الحروق و التجميل", go: "/mfm" },
              { name: "مجمع العنايات المركزه", go: "/mfm" },
              { name: "المراكزالطبيه الجديدة", go: "/mfm" },
              { name: "مركز الخلايا الجذعية", go: "/mfm" },
              { name: "مركز جراحة الجهاز الهضمي", go: "/mfm" },
              { name: "مركز البحوث الطبية التجريبية", go: "/mfm" },
              { name: "مركز الاورام", go: "/mfm" },
              { name: "مستشفي الاطفال الجامعي", go: "/mfm" },
              { name: "مستشفي الباطنة التخصصي", go: "/mfm" },
              { name: "مستشفي الطوارئ", go: "/mfm" },
            ],
          },
          {
            name: "الوحدات",
            subLinks: [
              {
                name: "وحدة التعليم الالكتروني و تكنولوجيا المعلومات",
                go: "/mfm",
              },
              {
                name: "وحدة الطلاب الوافدين",
                go: "/mfm",
              },
              {
                name: "وحدة دعم الابداع و الابتكار",
                go: "/mfm",
              },
              {
                name: "وحدة ضمان الجودة",
                go: "/mfm",
              },
              {
                name: "وحدة رابطة خريجي طب المنصورة",
                go: "/mfm",
              },
              {
                name: "وحدة اضطرابات النوم النفسية",
                go: "/mfm",
              },
              {
                name: "وحدة الدعم الطلابي",
                go: "/mfm",
              },
              {
                name: "وحدة ادارة الازامات و الكوارث",
                go: "/mfm",
              },
              {
                name: "وحدة القياس و التقويم",
                go: "/mfm",
              },
              {
                name: "الادارة المركزية للجودة",
                go: "/mfm",
              },
            ],
          },
          {
            name: "المعامل",
            subLinks: [
              {
                name: "معمل النزف و التجلط",
                go: "/mfm",
              },
              {
                name: "معمل الفيروسات الطبية",
                go: "/mfm",
              },
              {
                name: "معامل قسم الطفيليات",
                go: "/mfm",
              },
              {
                name: "معامل قسم الصحة العامة",
                go: "/mfm",
              },
              {
                name: "معمل قسم الفارماكولوجي",
                go: "/mfm",
              },
              {
                name: "معامل قسم الكيمياء الحيوية",
                go: "/mfm",
              },
              {
                name: "معمل قسم الباثولوجي",
                go: "/mfm",
              },
              {
                name: "معمل قسم الطب الشرعي",
                go: "/mfm",
              },
              {
                name: "معامل قسم الفيسيولوجي",
                go: "/mfm",
              },
              {
                name: "معامل قسم الباثولوجي الاكلينيكي",
                go: "/mfm",
              },
              {
                name: "معمل قسم التشريح",
                go: "/mfm",
              },
              {
                name: "معمل قسم الهستولوجي",
                go: "/mfm",
              },
            ],
          },
        ],
      },
    },
    {
      name: "اعضاء هيئة التدريس",

      dropdownLinks: {
        links: [
          { name: "نظام البيانات الاكاديميه لاعضاء هيئة التدريس", go: "/" },
          { name: "البريد الالكتروني لجامعة المنصوره", go: "/" },
          { name: "الحاصلون علي جوائز", go: "/" },
        ],
      },
    },
  ];
  /**style logo of Faculites */
  const logoStyle = {
    width: "140px",
    height: "80px",
  };
  const [showLoader, setShowLoader] = useState(true);

  useEffect(() => {
    const timer = setTimeout(() => {
      setShowLoader(false);
    }, 2000);

    return () => clearTimeout(timer);
  }, []);
  return (
    <html lang="ar" dir="rtl">
      <head>
        <link rel="icon" href="/assets/imgs/logo.png" />
        <title>الموقع الرسمى لكلية الطب جامعة المنوفية</title>
      </head>
      <body suppressHydrationWarning={true}>
        {showLoader ? (
          <Loader />
        ) : (
          <>
            {pathName === "/mfm" ? (
              <Nav
                logo="/assets/imgs/mfmLogo.png"
                logoStyle={logoStyle}
                data={mfmLinks}
              />
            ) : (
              <Nav logo="/assets/imgs/Logo.png" data={links} />
            )}
            <main>{children}</main>
          </>
        )}
      </body>
    </html>
  );
}
