"use client";
import Footer from "@/components/sections/Footer/Footer";
import Hero from "@/components/Hero/Hero";
import MakeAppoint from "@/components/MakeAppoint/MakeAppoint";
import Services from "@/components/servicessection/Services";
import Statistics from "@/components/statistics/Statistics";
import SubPagesLinks from "@/components/subpagescomp/SubPagesLinks";
import NewsSection from "@/sections/NewsSection";
import React from "react";
import { FaUserMd } from "react-icons/fa";
import { FaAward, FaFlask, FaRegHospital } from "react-icons/fa6";
import { FaHeartbeat } from "react-icons/fa";
import { FaHospitalUser } from "react-icons/fa6";
import { FaWheelchair } from "react-icons/fa6";
import { FaNotesMedical } from "react-icons/fa";
import { FaDna } from "react-icons/fa";
import { FaPills } from "react-icons/fa";
function page() {
  const dataOfHeroSection = [
    {
      backgrounImg: "/assets/imgs/slide1.png",
      title:
        "كلية الطب تنظم يوم علمي خاص بمرض Amyloidosis (الداء النشوانى ) متعدد التخصصات بالاقسام العلمية",
      // description:
      //   "عقد الدكتور أحمد القاصد رئيس جامعة المنوفية جلسة مجلس الجامعة لشهر يوليو ٢٠٢٤ بحضور نواب رئيس الجامعة الدكتور صبحى شرف لخدمة المجتمع وتنمية البيئة والدكتور حازم صالح للدراسات العليا والبحوث والدكتور ناصر عبدالبارى للتعليم والطلاب وعمداء الكليات.",
    },
    {
      backgrounImg: "/assets/imgs/slide2.png",
      title:
        "تسليم جائزةأ.د.بهاء السروى لأوائل دفعة كلية الطب (دفعه 36)للطبيب محمد خالد محمد ابو على",
      // description:
      //   "أعلن الدكتور أحمد القاصد رئيس جامعة المنوفية عن بدء إتخاذ الإجراءات اللازمة لإنشاء معهد الأورام كمعهد بحثي وعلاجي بعد موافقة المجلس الأعلى للجامعات برئاسة الدكتور أيمن عاشور وزير التعليم العالي والبحث العلمي، علي إنشائه في جلسته الأخيرة ، وحصول الجامعة علي موافقة لجنة القطاع الطبي من قبل .",
    },
    {
      backgrounImg: "/assets/imgs/slide3.png",
      title: "الأستاذ الدكتور / أحمد فرج القاصد يفتتـح قاعـة مجلـس الكليـة",
      // description:
      //   "قام الدكتور أحمد القاصد رئيس جامعة المنوفية، بتقديم التهنئة لجميع منسوبى الجامعة من أعضاء هيئة التدريس والعاملين والطلاب بقرب حلول عيد الأضحى المبارك، ، كما حرص رئيس الجامعة علي تقديم التهنئة للعاملين بالادارات المختلفة بمبني بالإدارة العامة للجامعة",
    },
  ];
  const newsData = {
    mainTitle: "اخر الاخبار",
    newsData: [
      {
        image: "./assets/imgs/new1mfm.png",
        date: "الاربعاء , 3 يوليو 2024",
        title:
          "استقبل الدكتور محمد فهمي النعماني عميد كلية الطب ورئيس مجلس إدارة المستشفيات الجامعية اللواء إبراهيم أبو ليمون محافظ المنوفية وذلك في إطار زيارة الأخير للمستشفيات الجامعية وتفقد الخدمات الطبية المقدمة",
        // views: 123,
      },
      {
        image: "./assets/imgs/new2mfm.png",
        date: "الاربعاء , 27 يوليو 2024",

        title:
          "بدء التشغيـل التجريبـي لأحـدث جهـاز قسطـرة قلبيـة بالمستشفيـات الجامعية تحت رعاية معالي السيد الاستاذ الدكتور أحمد فرج القاصد وبقيادة الدكتور محمد فهمي النعماني عميد الكلية ورئيس مجلس إدارة المستشفيات الجامعية تم بدء التشغيل التجريبي لأحدث جهاز قسطره قلبية متعدد الاستخدامات موديل Azurion 7 M20 بالمستشفيات الجامعية بحضور كلا من الدكتور محمود سليمان رئيس قسم امراض القلب والأوعية الدموية ،الدكتورة غادة سلطان ،الدكتور وليد عبده ،وعدد من أعضاء الهيئة المعاونة بقسم امراض القلب والأوعية الدموية",
        // views: 456,
      },
      {
        image: "./assets/imgs/new3mfm.png",
        date: "الخميس , 1 اغسطس 2024",

        title:
          "طب المنوفية تنظم ندوة تعريفية بأهمية إدارة المخاطر تحت رعاية الدكتور أحمد فرج القاصد رئيس الجامعة،والدكتور صبحي شرف نائب رئيس الجامعة لشئون خدمة المجتمع وتنمية البيئة و في إطار خطوات تطوير كلية الطب والارتقاء بالمستوى التعليمي والبنية التحتية بالكلية، عقد اليوم الدكتور محمد فهمي النعماني عميد الكلية ورئيس مجلس إدارة المستشفيات الجامعيه ندوة تعريفية عن أهمية إدارة المخاطر و ذلك بحضورالدكتورة أميرة فتحي عبدالعاطي مدير وحدة ضمان الجوده، الدكتور محمد السنباوي مدير وحده إدارة المخاطر بالكلية ،وعدد من منسقي الاقسام ،والاداريين",
        // views: 789,
      },
    ],
  };
  const MakeAppointData = {
    title: "تــاريــخ كــلــيــة الــطــب",
    description:
      "تم إنشاء كلية الطب بجامعة المنوفية بموجب القرار الجمهوري رقم 1142 في عام 1976، ومقرها في شبين الكوم. بدأت المرحلة السريرية للدراسة في 27 أكتوبر 1984، بـ 54 طالبًا. انتقلت الكلية إلى موقعها الحالي خلف المستشفى الجامعي في عام 1986، وتضم الآن 31 قسمًا، وتقدم درجات البكالوريوس، والدبلوم، والماجستير، والدكتوراه.",
    btnText: "اسـتـكـشـف الـمـزيـد",
    path: "#",
  };
  const dataofStatistics = [
    {
      icon: <FaUserMd />,
      num: 100,
      subtitel: "اعـضـاء هـيـئـة الـتـدريـس",
      description: "",
    },
    {
      icon: <FaRegHospital />,
      num: 26,
      subtitel: "الاقـسـام",
      description: "",
    },
    {
      icon: <FaFlask />,
      num: 15,
      subtitel: "الابـحـاث الـعـلـمـيـة",
      description: "",
    },
    {
      icon: <FaAward />,
      num: 150,
      subtitel: "الـجـوائـز",
      description: "",
    },
  ];
  const dataofServices = {
    caption:
      "كلية الطب بجامعة المنوفية تقدم مجموعة واسعة من الخدمات التعليمية والطبية والبحثية التي تهدف إلى تحسين الصحة العامة وتطوير العلوم الطبية. تأسست الكلية لتلبية احتياجات المجتمع المحلي من الأطباء المؤهلين وتوفير رعاية طبية عالية الجودة. تشمل خدمات الكلية برامج تعليمية متقدمة في مختلف التخصصات الطبية، وتدريب طلاب الطب والكوادر الطبية في المستشفيات التعليمية، بالإضافة إلى إجراء الأبحاث الطبية الحيوية التي تسهم في تطوير العلاجات وتحسين الخدمات الصحية. تسعى الكلية دائمًا إلى تعزيز التعاون مع المؤسسات الصحية والعلمية الأخرى على الصعيدين المحلي والدولي، لضمان تقديم أفضل مستوى من التعليم والخدمات الصحية.",
    cardsData: [
      {
        icon: <FaHeartbeat />,
        title: "البرامج التعليمية المتقدمة",
        description:
          "تقدم الكلية برامج تعليمية متنوعة تشمل درجات البكالوريوس، والدبلوم، والماجستير، والدكتوراه في مختلف التخصصات الطبية.",
      },
      {
        icon: <FaPills />,
        title: "التدريب الطبي والسريري",
        description:
          "وفر الكلية فرص تدريب عملية لطلاب الطب والكوادر الطبية في المستشفيات التعليمية التابعة لها. يشمل التدريب العملي التعامل المباشر مع المرضى.",
      },
      {
        icon: <FaHospitalUser />,
        title: "الأبحاث الطبية الحيوية",
        description:
          "تعمل الكلية على دعم وتشجيع الأبحاث الطبية الحيوية التي تهدف إلى تطوير العلاجات وتحسين الخدمات الصحية.",
      },
      {
        icon: <FaDna />,
        title: "الخدمات الطبية والاستشارية",
        description:
          "تقدم الكلية خدمات طبية واستشارية للمجتمع المحلي من خلال مستشفياتها التعليمية. تشمل هذه الخدمات الاستشارات الطبية، والتشخيص، والعلاج في مختلف التخصصات الطبية.",
      },
      {
        icon: <FaWheelchair />,
        title: "التعاون والشراكات الدولية",
        description:
          "تسعى الكلية إلى تعزيز التعاون مع المؤسسات الصحية والعلمية الدولية لتبادل المعرفة والخبرات. ",
      },
      {
        icon: <FaNotesMedical />,
        title: "الدورات التدريبية وورش العمل",
        description:
          "قدم الكلية دورات تدريبية وورش عمل متخصصة للطلاب والمهنيين الطبيين بهدف تطوير مهاراتهم ومعرفتهم في مجالات محددة.",
      },
    ],
  };
  return (
    <div>
      <Hero data={dataOfHeroSection} />
      <NewsSection data={newsData} />
      <MakeAppoint data={MakeAppointData} />
      <Statistics data={dataofStatistics} />
      <Services data={dataofServices} />
      <SubPagesLinks />
      <Footer />
    </div>
  );
}

export default page;
